cask_args no_quarantine: true

brew "zsh"
brew "zsh-lovers"
brew "zsh-completions"
brew "bash"
brew "fzf"
brew "zoxide"
brew "vim"
brew "neovim"
brew "tree"
brew "ripgrep"
brew "ag"
brew "ispell"
brew "aspell"
brew "hunspell"
brew "graphviz"
brew "gcc"
brew "eza"
brew "fd"
brew "bat"
brew "git-delta"
brew "cloc"
brew "thefuck"
brew "fontconfig"
brew "coreutils"
brew "ssh-copy-id"
brew "git"
brew "mas"
brew "topgrade"
brew "jq"
brew "tldr"
brew "htop"
brew "openssl"
brew "gh"

brew "starship"

# cask "mailmate"
# cask "marta"
# cask "raycast"
# cask "launchbar"
# cask "iterm2"
# cask "spotify"
# cask "vivaldi"
# cask "firefox"
# cask "jetbrains-toolbox"
# cask "1password"
cask "karabiner-elements"
cask "contexts"
cask "daisydisk"
cask "signal"
cask "visual-studio-code"

tap "homebrew/cask-fonts"

cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-dejavu"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-latin-modern-math"
cask "font-stix-two-math"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-sans-math"
cask "font-noto-sans-symbols"
cask "font-noto-sans-symbols-2"

tap "railwaycat/emacsmacport"

brew "gnutls"
brew "jansson"
brew "libxml2"
brew "texinfo"
brew "imagemagick"
brew "emacs-mac"

brew "asdf"
brew "gpg"
brew "gawk"

brew "ranger"
brew "w3m"
brew "most"

tap "homebrew/cask-versions"

cask "beyond-compare"

brew "languagetool"

brew "duf"
brew "dust"
brew "httpie"
brew "ncdu"
brew "fx"
brew "lazydocker"
brew "glow"
brew "ki"

brew "sqlite"
brew "wordnet"
brew "proselint"

brew "aws-vault"
brew "awscli"
brew "localstack"
