
brew "zsh"
brew "zsh-lovers"
brew "zsh-completions"
brew "bash"
brew "fzf"
brew "zoxide"
brew "vim"
brew "neovim"
brew "tree"
brew "ripgrep"
brew "ag"
brew "ispell"
brew "aspell"
brew "hunspell"
brew "graphviz"
brew "gcc"
brew "exa"
brew "fd"
brew "bat"
brew "git-delta"
brew "cloc"
brew "thefuck"
brew "fontconfig"
brew "coreutils"
brew "ssh-copy-id"
brew "git"
brew "mas"
brew "topgrade"
brew "jq"
brew "tldr"
brew "htop"
brew "openssl"
brew "gh"

cask "mailmate"
cask "marta"
cask "raycast"
cask "launchbar"
cask "iterm2"
cask "marvin"
cask "spotify"
cask "vivaldi"
cask "firefox"
cask "jetbrains-toolbox"
cask "devutils"
cask "1password"
cask "bartender"
cask "karabiner-elements"
cask "istat-menus"
cask "brave-browser"
cask "contexts"
cask "daisydisk"
cask "signal"
cask "visual-studio-code"
cask "swish"

tap "homebrew/cask-fonts"

cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

tap "railwaycat/emacsmacport"

brew "gnutls"
brew "jansson"
brew "libxml2"
brew "texinfo"
brew "imagemagick"

cask "emacs-mac"

brew "asdf"
brew "gpg"
brew "gawk"
